// Array of questions grouped by category (25 questions each)
const questions = [
  {
    category: "លក្ខណៈរបស់តារាងខួបនៃធាតគីមី",
    questions: [
      {
        question: "តារាងដែលមាននិមិត្តសញ្ញា ឈ្មោះ លក្ខណៈនិងទម្រង់អាតូមរបស់ធាតុ ហៅថា?",
        options: ["ក្រុម", "សៀវភៅ", "ស៊េរី", "តារាងខួប"],
        correctAnswer: 3,
      },
      {
        question: "អ្នកដែលបង្កើតតារាងខួបមុនគេឈ្មោះអ្វី?",
        options: ["អាវ៉ូកាដ្រូ", "មិនដេលេយេវ", "ញូតុន", "ដាល់តុន"],
        correctAnswer: 1,
      },
      {
        question: "ជួរឈនៃធាតុគីមីនៅក្នុងតារាងខួប គឺជាអ្វី?",
        options: ["ក្រុម", "ខួប", "ស៊េរី", "អាតូម"],
        correctAnswer: 0,
      },
      {
        question: "ជួរដេកនៃធាតុគីមីនៅក្នុងតារាងខួប គឺជាអ្វី?",
        options: ["ក្រុម", "ខួប", "ស៊េរី", "អាតូម"],
        correctAnswer: 1,
      },
      {
        question: "តើគេចែកធាតុគីមីក្នុងតារាងខួបជាប៉ុន្មាន ខួប??",
        options: ["5", "6", "7", "8"],
        correctAnswer: 2,
      },
      {
        question: "តេគេចែកធាតុគីមីក្នុងតារាងខួបខ្លី(ចាស់) ជាប៉ុន្មាន ក្រុម?",
        options: ["5", "6", "7", "8"],
        correctAnswer: 3,
      },
      {
        question: "តើគេចែកធាតុគីមីក្នុងតារាងខួបវែង(ថ្មី)ជាប៉ុន្មាន ក្រុម?",
        options: ["15", "16", "17", "18"],
        correctAnswer: 3,
      },
      {
        question: "តើលេខខួបប្រាប់យើងឱ្យដឹងអំពីអ្វី?",
        options: ["ចំនួនប្រូតុង", "ចំនួនណីត្រុង", "ចំនួនស្រទាប់អេឡិចត្រុង", "ចំនួនម៉ាស"],
        correctAnswer: 0,
      },
      {
        question: "តើលេខក្រុមប្រាប់យើងឱ្យដឹងអំពីអ្វី?",
        options: ["ចំនួនប្រូតុង", "ចំនួនណីត្រុង", "ចំនួនអេឡិចត្រុងវ៉ាឡង់", "ចំនួនម៉ាស"],
        correctAnswer: 2,
      },
      {
        question: "លោហៈអាល់កាឡាំង ស្ថិតក្នុងក្រុមទីប៉ុន្មាន?",
        options: ["1", "2", "3", "4"],
        correctAnswer: 0,
      },
      {
        question: ". សមាសធាតុអាឡូសែនស្ថិតក្នុងក្រុមទីប៉ុន្មាន?",
        options: ["5", "6", "7", "8"],
        correctAnswer: 2,
      },
      {
        question: "ក្រុមលោហៈឆ្លងស្ថិតនៅចន្លោះក្រុមទីប៉ុន្មាន?",
        options: ["1&2", "2&3", "3&4", "4&5"],
        correctAnswer: 2,
      },
      {
        question: "- ឧស្ម័នកម្រ ស្ថិតក្នុងក្រុមទីប៉ុន្មាន?",
        options: ["5", "6", "7", "8"],
        correctAnswer: 3,
      },
      {
        question: "នៅក្នុងតារាងខួប តើឧស្ម័នកម្រស្ថិតនៅផ្នែកខាងណា?",
        options: ["ឆ្វេង", "ឆ្វេងបង្អស់", "ស្តាំបង្អស់", "ស្តាំ"],
        correctAnswer: 2,
      },
      {
        question: "នៅក្នុងតារាងខួប តើលោហៈអាកាឡាំងស្ថិតនៅផ្នែកខាងណា?",
        options: ["ឆ្វេង", "ឆ្វេងបង្អស់", "ស្តាំបង្អស់", "ស្តាំ"],
        correctAnswer: 1,
      },
      {
        question: "នៅក្នុងតារាងខួប តើលោហៈអាកាលីណូទែរ៉ឺស្ថិតនៅផ្នែកខាងណា?",
        options: ["ឆ្វេង", "ឆ្វេងបង្អស់", "ស្តាំបង្អស់", "ស្តាំ"],
        correctAnswer: 0,
      },
      {
        question: "នៅក្នុងតារាងខួប តើអាឡូសែនស្ថិតនៅផ្នែកខាងណា?",
        options: ["ឆ្វេង", "ឆ្វេងបង្អស់", "ស្តាំបង្អស់", "ស្តាំ"],
        correctAnswer: 3,
      },
      {
        question: "ភិនភាគ ពណ៌ ក្លិន ដង់ស៊ីតេ ចំណុចរំពុះ រលាយ សុទ្ធតែជាផ្នែកផ្សេងៗនៃ លក្ខណៈ?",
        options: ["គីមី", "រូប", "ក្រុម", "ខួប"],
        correctAnswer: 1,
      },
      {
        question: "ប្រតិកម្មគីមីជាផ្នែកសំខាន់នៃលក្ខណៈ?",
        options: ["គីមី", "រូប", "ក្រុម", "ខួប"],
        correctAnswer: 0,
      },
      {
        question: "ក្នុងតារាងខួបគេរៀបធាតុគីមី",
        options: ["តាមលំដាប់កើននៃចំនួនម៉ាស់", "តាមលំដាប់កើននៃចំនួនប្រូតុងលេខអាតូម", "តាមលំដាប់កើននៃចំនួនណឺត្រុង"],
        correctAnswer: 1,
      },
      {
        question: "អំបូរឡង់តានីតផ្តើមចេញពីធាតុ?",
        options: ["Lu", "Li", "La", "Lw"],
        correctAnswer: 2,
      },
      {
        question: "អំបូរឡងតានីតមានធាតុគីមី?",
        options: ["5ធាតុ", "10ធាតុ", "15ធាតុ", "20ធាតុ"],
        correctAnswer: 2,
      },
      {
        question: "អំបូរអាក់ទីនីតផ្តើមចេញពីធាតុ?",
        options: ["Ag", "Ar", "Ac", "Am"],
        correctAnswer: 2,
      },
      {
        question: "អំបូរអាក់ទីនីតផ្តើមធាតុគីមី?",
        options: ["5ធាតុ", "10ធាតុ", "15ធាតុ", "20ធាតុ"],
        correctAnswer: 2,
      },
      {
        question: "លោហៈដែលរាវនៅសីតុណ្ហភាពប្រក្រតីគឺ?",
        options: ["Hg", "Mg", "Ag", "Au"],
        correctAnswer: 0,
      },
    ],
  },
  {
    category: "ក្រុមIA:លោហៈអាល់កាឡាំង",
    questions: [
      {
        question: "1.	ក្រុមទី១ នៃតារាខួបមានឈ្មោះ",
        options: ["A.	លោហៈអាល់កាឡាំង", "B.	លោហៈឆ្លង", "C.	ឧស្ម័នកម្រ", "D.	ក្រុមអាឡូសែន"],
        correctAnswer: 0,
      },
      {
        question: "2.	តើធាតុណាខ្លះឋិតនៅក្នុងក្រុមលោហៈអាល់កាឡាំង?",
        options: ["A.	Li, Na, K,Rb, Cs, Fr", "B.	Cu, Zn, Cr, Au, Pb, Mn", "C.	F, Cl, Br, I", "D.	He, Ne ,Ar, Xe, Rn"],
        correctAnswer: 0,
      },
      {
        question: "3.	តើគេរក្សាលោហៈអាល់កាឡាំងនៅក្នុងអ្វី?",
        options: ["A.	ប្រេកាត ឬកេរ៉ូសុល", "B.	ទឹក", "C.	អុកស៊ីសែន", "D.	ដី"],
        correctAnswer: 0,
      },
      {
        question: "4.	លោហៈអាល់កាឡាំងដែលមានលក្ខណៈគីមីសកម្មខ្លាំងជាងគេគឺ",
        options: ["A.	Na", "B.	K", "C.	Rb", "D.	Cs"],
        correctAnswer: 3,
      },
      {
        question: "5.	លោហៈអាល់កាឡាំងដែលមានលក្ខណៈគីមីសកម្មខ្សោយជាងគេគឺ",
        options: ["A.	Na", "B.	K", "C.	Rb", "D.	Li"],
        correctAnswer: 3,
      },
      {
        question: "6.	លោហៈអាល់កាឡាំងប្រតិកម្មជាមួយទឹកបង្កើតបានជាសូលុយស្យុងបាស និង",
        options: ["A. ឧស្ម័នអ៊ីដ្រូសែន", "B. ទឹក", "C. ឧស្ម័នអុកស៊ីសែន", "D. ឧស្ម័នកម្រ"],
        correctAnswer: 0,
      },
      {
        question: "7. លោហៈអាល់កាឡាំងប្រតិកម្មជាមួយអុកស៊ីសែនបង្កើតបានជា",
        options: ["A.	អាស៊ីត", "B.	អុកស៊ីត", "C.	បាស", "D.	អំបិល"],
        correctAnswer: 1,
      },
      {
        question: "8.	លោហៈអាល់កាឡាំងមានលក្ខណៈដូចជា",
        options: ["A. ទន់អាចកាត់នឹងកាំបិត ឬឡាមបាន", "B. រឹងជាងគេបំផុតក្នុងធម្មជាតិ", "C. ជាឧស្ម័នពុលខ្លាំង", "D. គ្មានប្រតិកម្មជាមួយធាតុដទៃ"],
        correctAnswer: 0,
      },
      {
        question: "9. លោហៈអាល់កាឡាំងប្រតិកម្មជាមួយអាឡូសែនបង្កើតបាន",
        options: ["A.	អំបិលអាឡូសែនួ", "B.	អុកស៊ីត", "C.	អាស៊ីត", "D.	បាស"],
        correctAnswer: 0,
      },
      {
        question: "10.	សូដ្យូម + ក្លរ  →  ",
        options: ["A.	សូដ្យូមក្លរួ", "B.	សូដ្យូមអុកស៊ីត", "C.	សូដ្យូមអ៊ីដ្រុកស៊ីត", "D.	សូដ្យូមក្លរ៉ាត"],
        correctAnswer: 0,
      },
      {
        question: "11.	លោហៈអាល់កាឡាំងអណ្ដែតលើទឹកព្រោះ",
        options: ["A.	មានដង់ស៊ីតេធំជាងទឹក", "B.	វាជាលោហៈ", "C.	គ្មានប្រតិកម្មជាមួយទឹក", "D.	មានដង់ស៊ីតេតូចជាងទឹក"],
        correctAnswer: 3,
      },
      {
        question: "12.	លក្ខណៈរូបលោហៈអាល់កាឡាំងមានដូចជា",
        options: ["A.	ពណ៌មាស, រឹងជាគេក្នុងធម្មជាតិ", "B.	ប្រតិកម្មជាមួយទឹក", "C.	លោហៈសកម្មជាងគេ", "D.	ពណ៌សដូចប្រាក់, ទន់អាចកាត់នឹងកាំបិត ឬឡាមបាន"],
        correctAnswer: 3,
      },
      {
        question: "13.	តើលោហៈអាល់កាឡាំងឋិតនៅផ្នែកខាងណានៃតារាងខួប?",
        options: ["A.	ខាងឆ្វេងបំផុតនៃតារាងខួប", "B.	ខាងស្ដាបំផុតនៃតារាងខួប", "C.	ចំកណ្ដាលនៃតារាងខួប", "D.	ខាងក្រោមបំផុតនៃតារាងខួប"],
        correctAnswer: 0,
      },
      {
        question: "14.	តើប្រតិកម្មចំហេះរបស់ Lithium ជាមួយអុកស៊ីសែនបង្កើតអ្វី?",
        options: ["A. LiO₂", "B. Li₂O ", "C. LiCl", "D. LiOH"],
        correctAnswer: 1,
      },
      {
        question: "15.	តើLithium ប្រតិកម្មជាមួយទឹកបង្កើតអ្វី?",
        options: ["A. ទឹក និងអំបិល", "B. បាសអាល់កាលី និងឧស្ម័ន H₂ ", "C. បាសអាល់កាលី", "D. អាស៊ីតខ្លាំង"],
        correctAnswer: 1,
      },
      {
        question: "16.	តើអាតូមលោហៈអាល់កាឡាំងនីមួយៗមានអេឡិចត្រុងប៉ុន្មាននៅក្នុងសម្បកក្រៅបំផុតរបស់វា",
        options: ["A. 2 ", "B. 8 ", "C. 1 ", "D. 7"],
        correctAnswer: 2,
      },
      {
        question: "17.	ហេតុអ្វីបានជាលោហៈអាល់កាឡាំងត្រូវបានរក្សាទុកក្នុងប្រេង (ដូចជាប្រេងកាត) នៅក្នុងមន្ទីរពិសោធន៍? ",
        options: ["A. ដើម្បីការពារពួកវាពីការកក។ ", "B. ដើម្បីការពារពួកវាពីប្រតិកម្មជាមួយអុកស៊ីហ្សែន និងសំណើមនៅក្នុងខ្យល់។ ", "C. ដើម្បីបង្កើនភាពរលោងរបស់ពួកវា។ ", "D. ព្រោះពួកវារលាយក្នុងទឹកយ៉ាងលឿន។"],
        correctAnswer: 1,
      },
      {
        question: "18. តើអ៊ីយ៉ុងដែលបង្កើតឡើងដោយលោហៈអាល់កាឡាំងមានបន្ទុកប៉ុន្មាន",
        options: ["A. -1 ", "B. -2", " C. +1 ", "D. +2"],
        correctAnswer: 2,
      },
      {
        question: "19. តើការបង្កើតអ៊ីយ៉ុងរបស់លោហៈអាល់កាឡាំងពាក់ព័ន្ធនឹងដំណើរការអ្វី? ",
        options: ["A. ការទទួលយកអេឡិចត្រុង ", " B. ការបាត់បង់អេឡិចត្រុង ", " C. ការចែករំលែកអេឡិចត្រុង ", "D. ការបង្កើតចំណងអ៊ីដ្រូសែន។"],
        correctAnswer: 1,
      },
      {
        question: "20. តើលោហៈអាល់កាឡាំងបង្ហាញពណ៌អណ្តាតភ្លើង (Flame Test Color) អ្វីខ្លះនៅពេលដុត? ",
        options: ["A. គ្មានពណ៌ (Colorless)", " B. ពណ៌បៃតងស្រាល (Light Green)", " C. ពណ៌ខ្មៅ (Black)", " D. ពណ៌លក្ខណៈជាក់លាក់ (Characteristic Colors) ដូចជា ក្រហម ស្វាយ និងលឿង"],
        correctAnswer: 3,
      },
      {
        question: "21. តើលោហៈអាល់កាឡាំងទាំងអស់មានលក្ខណៈសម្បត្តិអ្វីខ្លះដែលអនុញ្ញាតឱ្យពួកវាធ្វើចរន្តអគ្គិសនី និងកម្តៅបានល្អ? ",
        options: ["A. មានចំណុចរលាយទាប។ ", "B. មានអេឡិចត្រុងសេរីដែលផ្លាស់ទី ", "C. មានពណ៌ប្រាក់ ", "D. មានប្រតិកម្មជាមួយទឹក។"],
        correctAnswer: 1,
      },
      {
        question: "22. ក្នុងតារាងខួបនៃធាតុគីមី លោហៈអាល់កាឡាំងមានលក្ខណៈសកម្មពី",
        options: ["ក. លើចុះក្រោម", "ខ. ក្រោមឡើងលើ", "គ. ឆ្វេងទៅស្តាំ", "ឃ. ស្តាំទៅឆ្វេង"],
        correctAnswer: 0,
      },
      {
        question: "23. នៅពេលលោហៈសូដ្យូមប្រតិកម្មជាមួយទឹកឱ្យផលជា ",
        options: ["ក. សូដ្យូមអុកស៊ីត និងអ៊ីដ្រូសែន", "ខ. សូដ្យូមអ៊ីដ្រុកស៊ីត និងអ៊ីដ្រូសែន", "គ. សូដ្យូមអ៊ីដ្រូ និងអ៊ីដ្រូសែន", "ឃ. សូដ្យូមក្លរួ និងអីដ្រូសែន"],
        correctAnswer: 1,
      },
      {
        question: "24. តើសមីការណាមួយដែលត្រឹមត្រូវបំផុតសម្រាប់ប្រតិកម្មនៃ Li ជាមួយ H₂O?",
        options: ["ក. Li + H2O → LiOH + H2", "ខ. 2Li + 2H2O → 2LiH + H2", "គ. 2Li + H2O → Li2O + H2", "ឃ. 2Li + 2H2O → 2LiOH + H2"],
        correctAnswer: 3,
      },
      {
        question: "25. លោហៈសូដ្យូមប្រតិកម្មជាមួយឧស្ម័នអុកស៊ីសែនតាងដោយសមីការ ។",
        options: ["ក. Na + O2 →  Na2O", "ខ.6Na + O2 → 2Na3O", "គ. 4Na + O2 → 2Na2O", "ឃ. 2Na + O2 → 2NaO"],
        correctAnswer: 2,
      },
    ],
  },
  {
    category: "ក្រុមVIIA:អាឡូសែន",
    questions: [
      {
        question: "តើក្រុមអាឡូសែនមានធាតុអ្វីខ្លះ?",
        options: ["ក.ភ្លុយអរ ក្លរ ប្រូម និងអ៊ីយ៉ូត", "ខ.អាសូត កាបូន អុកស៊ីសែន ភ្លុយអរ", "គ.អេល្យូម ណេអុង គ្រីបតុង សេណុង រ៉ាដុង", "ឃ.អាសូត ភ្លុយអរ ក្លរ អ៊ីយ៉ូត អិកស៊ីសែន"],
        correctAnswer: 0,
      },
      {
        question: "ចូរតម្រៀបលំដាប់លក្ខណៈសកម្មរបស់ក្រុមអាឡូសែនតាមលំដាប់កើន។",
        options: ["ក.I2<Cl2<Br2<F2", "ខ.I2>Cl2>Br2>F2", "គ.I2<Cl2<Br2>F2", "ឃ.I2<Br2<Cl2<F2"],
        correctAnswer: 3,
      },
      {
        question: "ចូរប្រាប់លក្ខណៈពណ៌របស់ធាតុនីមួយៗនៃក្រុមអាឡូសែន។",
        options: ["ក.ភ្លុយអរ(ពណ៌ត្រួយចេក) ក្លរ(ពណ៌លឿងស្រលែត) ប្រូម(ពណ៌ស្វាយ) អ៊ីយ៉ូត(ពណ៌ក្រហមត្នោត)", "ខ. ភ្លុយអរ(ពណ៌លឿងស្រលែត) ក្លរ(ពណ៌ត្រួយចេក) ប្រូម(ពណ៌ក្រហមត្នោត) អ៊ីយ៉ូត(ពណ៌ស្វាយ)", "គ.ភ្លុយអរ(ពណ៌ក្រហមត្នោត) ក្លរ(ពណ៌លឿងស្រលែត) ប្រូម(ពណ៌ស្វាយ) អ៊ីយ៉ូត(ពណ៌ត្រួយចេក)", "ឃ.ភ្លុយអរ(ពណ៌ក្រហមត្នោត) ក្លរ(ពណ៌ស្វាយ) ប្រូម(ពណ៌លឿងស្រលែត) អ៊ីយ៉ូត(ពណ៌ត្រួយចេក)"],
        correctAnswer: 1,
      },
      {
        question: "តើលក្ខណៈប្រតិកម្មអាឡូសែនមានប៉ុន្មាន?អ្វីខ្លះ?",
        options: ["ក.មាន២៖ប្រតិកម្មចំហេះ និងប្រតិកម្មលោហៈ", "ខ.មាន៣៖ប្រតិកម្មជាមួយលោហៈ ប្រតិកម្មជាមួយទឹក និង ប្រតិកម្មជំនួស", "គ.មាន២៖ប្រតិកម្មជាមួយលោហៈ និងប្រតិកម្មជំនួស", "ឃ.មាន៣៖ប្រតិកម្មជាមួយទឹក ប្រតិម្មចំហេះ និង ប្រតិកម្មបូកផ្សំ"],
        correctAnswer: 2,
      },
      {
        question: "ក្រុមអាឡូសែនមានអេឡិចត្រង់ស្រទាប់ក្រៅដូចៗគ្នាមានប៉ុន្មានអេឡិចត្រង់?",
        options: ["ក.5e ", "ខ.6e ", "គ.7e", "ឃ.8e"],
        correctAnswer: 2,
      },
      {
        question: "តើក្រុមអាឡូសែន ស្ថិតនៅក្រុមទីប៉ុន្មាននៃតារាងខួប?",
        options: ["ក.17", "ខ.18", "គ.15", "ឃ.16"],
        correctAnswer: 0,
      },
      {
        question: "តើធាតុអាឡូសែនមួយណាដែលមានភាពរូបរឹង?",
        options: ["ក.ក្លរ", "ខ.អ៊ីយ៉ូត", "គ.ប្រូម ", "ឃ.ភ្លុយអរ"],
        correctAnswer: 1,
      },
      {
        question: "ក្រុមអាឡូសែនក្នុងធាតុមានបន្ទុកដក(អ៊ីយ៉ុងអវិជ្ជមាន)ខាងលើមានន័យថាដូចម្តេច?",
        options: ["ក.លើសអេឡិចត្រុង", "ខ.ខ្វះអេឡិចត្រុង ", "គ.ទទួលអេឡិចត្រុង ", "ឃ.បោះបង់អេឡិចត្រុង"],
        correctAnswer: 1,
      },
      {
        question: "តើក្លរស្ថិតនៅខួបទីប៉ុន្មាន?",
        options: ["ក.2", "ខ.4", "គ.5", "ឃ.3"],
        correctAnswer: 3,
      },
      {
        question: "ក្លរស្ថិតនៅក្រុមអាឡូសែនមានអេឡិចត្រុងស្រទាប់ក្រៅ 7e វាត្រូវការ 1e ទៀតដើម្បីឱ្យមានស្ថេរភាពដូចឧស្ម័នកម្រ។នៅពេលវាទទួលយក 1e វាមានទម្រង់អ៊ីយ៉ុងដូចម្តេច?",
        options: ["ក.Cl^-", "ខ.Cl^2-", "គ.Cl^+", "ឃ.Cl"],
        correctAnswer: 0,
      },
      {
        question: "ភ្លុយអរនៅក្រុមអាឡូសែនមានអេឡិចត្រុងស្រទាប់ក្រៅ 7e វាត្រូវការ 1e ទៀតដើម្បីឱ្យមានស្ថេរភាពដូចឧស្ម័នកម។នៅពេលវាទទួលយក 1e វាមានទម្រង់អីយ៉ុងដូចម្តេច?",
        options: ["ក.F", "ខ.F^-", "គ.F^+", "ឃ.F^2-"],
        correctAnswer: 1,
      },
      {
        question: "តើក្លរមានលេខអាតូម និងម៉ាសអាតូមប៉ុន្មាន?",
        options: ["ក.លេខអាតូម13 ម៉ាស35.45", "ខ.លេខអាតូម17 ម៉ាស34.35", "គ.លេខអាតូម17 ម៉ាស 35.45", "ឃ.លេខអាតូម19 ម៉ាស35.45"],
        correctAnswer: 2,
      },
      {
        question: "តើភ្លុយអរមានលេខអាតូម និងម៉ាសអាតូមប៉ុន្មាន?",
        options: ["ក.លេខអាតូម7 ម៉ាស18.998", "ខ.លេខអាតូម9 ម៉ាស18.998", "គ.លេខអាតូម9 ម៉ាស 17.8", "ឃ.លេខអាតូម11 ម៉ាស23"],
        correctAnswer: 1,
      },
      {
        question: "តើលេខអាតូមរបស់អ៊ីយ៉ូតស្មើប៉ុន្មាន?",
        options: ["ក.45", "ខ.52", "គ.51", "ឃ.53"],
        correctAnswer: 3,
      },
      {
        question: "តើធាតុដែលស្ថិតនៅក្រុមទី១៧ ខួបទី២ជាអ្វី?",
        options: ["ក.F", "ខ.Cl", "គ.I", "ឃ.Br"],
        correctAnswer: 0,
      },
      {
        question: "តើធាតុដែលស្ថិតនៅក្រុមទី១៧ ខួបទី៣ជាអ្វី?",
        options: ["ក. F", "ខ.Cl", "គ. I", "ឃ. Br6"],
        correctAnswer: 1,
      },
      {
        question: "តើធាតុដែលស្ថិតនៅក្រុមទី១៧ ខួបទី៤ជាអ្វី?",
        options: ["ក. F", "ខ.Cl", "គ. I", "ឃ. Br"],
        correctAnswer: 3,
      },
      {
        question: "តើធាតុដែលស្ថិតនៅក្រុមទី១៧ ខួបទី៥ជាអ្វី?",
        options: ["ក. F", "ខ.Cl", "គ. I", "ឃ. Br"],
        correctAnswer: 2,
      },
      {
        question: "តើក្រុមអាឡូសែនស្ថិតនៅក្រុមទីប៉ុន្មាន?",
        options: ["ក.15", "ខ.16", "គ.17", "ឃ.18"],
        correctAnswer: 2,
      },
      {
        question: "តើក្រុមអាឡូសែនស្ថិតនៅខួបទីប៉ុន្មានខ្លះ?",
        options: ["ក.1,2,3,4", "ខ.2,3,5,6", "គ.2,3,4,5", "ឃ.3,4,5,6"],
        correctAnswer: 1,
      },
      {
        question: "តើធាតុ Br ស្ថិតនៅប្លុកអ្វី?",
        options: ["ក.s", "ខ.p", "គ.d", "ឃ.f"],
        correctAnswer: 1,
      },
      {
        question: "តើធាតុ I ស្ថិតនៅប្លុកអ្វី?",
        options: ["ក.s", "ខ.p", "គ.d", "ឃ.f"],
        correctAnswer: 1,
      },
      {
        question: "ធាតុ F មានលក្ខណៈអាតូមជា",
        options: ["ក. ឧស្ម័ន", "ខ. រឹង", "គ. រាវ", "ឃ. សូលុស្យុង"],
        correctAnswer: 0,
      },
      {
        question: "តើលេខអាតូមរបស់ប្រូមស្មើប៉ុន្មាន?",
        options: ["30", "35", "40", "45"],
        correctAnswer: 1,
      },
      {
        question: "តើប្រូមមានម៉ាសអាតូមប៉ុន្មាន?",
        options: ["30.91", "35.45", "79.90", "126.90"],
        correctAnswer: 2,
      },
    ],
  },
  {
    category: "ក្រុមVIIIA:ឧស្ម័នកម្រ",
    questions: [
      {
        question: "W1. ឧស្ម័នកម្រ ស្ថិតនៅក្រុមណា?",
        options: ["A. ក្រុម1", "B. ក្រុម 8", "JC. ក្រុម18", "D. ក្រុម17"],
        correctAnswer: 2,
      },
      {
        question: "2. ឧស្ម័នកម្រ មានលក្ខណៈពិសេសអ្វី?",
        options: ["A. ប្រតិកម្មខ្លាំង", "B. មិនធ្វើប្រតិកម្មងាយ ", "C. ជាលោហៈ", "D. រលាយក្នុងទឹកងាយ"],
        correctAnswer: 1,
      },
      {
        question: "3. Helium ប្រើសម្រាប់អ្វី?",
        options: ["A. បំពេញបំពង់ភ្លើង", "B. បំពេញតង់ឧស្ម័ន", "C. បំពេញប៉េងប៉ោង ", "D. ដុតឥន្ធនៈ"],
        correctAnswer: 2,
      },
      {
        question: " 4. Neon ប្រើសម្រាប់អ្វី?",
        options: ["BA. កាំភ្លើងឡាស៊ែរ", "B. ពន្លឺអគារ/ស្លាកពាណិជ្ជកម្ម ", "C. បំពេញធុងអុកស៊ីសែន", "D. ដុតឧស្ម័ន"],
        correctAnswer: 1,
      },
      {
        question: "5. Argon ប្រើសម្រាប់?",
        options: ["A. ជាតិសំលាប់មេរោគ", "B. ប្រើក្នុងជួសជុលរថយន្ត", "C. រក្សាសំណង់ផ្សារតង់ ", "D. ជាឧស្ម័នបំពង់ខ្យល់"],
        correctAnswer: 2,
      },
      {
        question: "  6. ឧស្ម័នណាដែលមានចំនួនច្រើនបំផុតក្នុងខ្យល់?",
        options: [" A. Neon", " B. Argon ", "C. Helium", "D. Xenon"],
        correctAnswer: 1,
      },
      {
        question: "7. Rn (Radon) មានអ្វីពិសេស?",
        options: ["A. មិនពុល", "B. ជាឧស្ម័នភ្លើង", "C. ជាឧស្ម័នវិទ្យុសកម្ម ", "D. ជាឧស្ម័នក្លិនខ្លាំង"],
        correctAnswer: 2,
      },
      {
        question: "8. ឧស្ម័នកម្រ អាចរកឃើញដោយសារតែ?",
        options: ["A. ប្រតិកម្មជាមួយអាស៊ីត", "B. ភាពអសកម្មគីមី", "C. ភាពរលាយទឹកខ្លាំង", "D. ក្លិនខ្លាំង"],
        correctAnswer: 1,
      },
      {
        question: "9. Xenon ប្រើសម្រាប់?",
        options: ["A. បំពង់ពន្លឺខ្ពស់ ", "B. ដុតឥន្ធនៈ", "C. បំពេញផ្ទះកញ្ចក់", "D. កាត់ដាច់អាតូម"],
        correctAnswer: 0,
      },
      {
        question: "10. Krypton ប្រើសម្រាប់?",
        options: ["A. ប៉េងប៉ោង", "B. បំពង់បំភ្លឺ ", "C. សាំង", "D. ផ្ទុះអាគីស"],
        correctAnswer: 1,
      },
      {
        question: "11. Helium មិនអាចប្រើដុតភ្លើងបាន ព្រោះ?",
        options: ["A. ពុល", "B. អសកម្មរហូត ", "C. ងាយកើតប្រតិកម្ម", "D. មានទម្ងន់ធ្ងន់"],
        correctAnswer: 1,
      },
      {
        question: "12. ឧស្ម័នកម្រ យើងហៅថា “Inert gases” ព្រោះ?",
        options: ["A. មានជាតិពុល", "B. មានក្លិន", "C. មិនប្រតិកម្មជាមួយឧស្ម័នផ្សេងស្ទើរតែមិន", " ងាយឆេះ"],
        correctAnswer: 2,
      },
      {
        question: "13. ឧស្ម័នណាអាចបង្កការរលាក?",
        options: ["A. Helium", "B. Neon", "C. Argon", "D. គ្មានណាមែនទេ"],
        correctAnswer: 3,
      },
      {
        question: "14. ឧស្ម័នកម្រ មានចំនួនអេឡិចត្រុងក្រៅបំផុត?",
        options: ["A. ពេញ", "B. 1", "C. 2", "D. 3"],
        correctAnswer: 0,
      },
      {
        question: "15. ឧស្ម័នណាដែលមានទម្ងន់ធ្ងន់បំផុត?",
        options: ["A. Helium", "B. Argon", "C. Radon ", "D. Neon"],
        correctAnswer: 2,
      },
      {
        question: "16. ឧស្ម័នណាដែលមានចំនួនតិចបំផុតក្នុងបរិយាកាស?",
        options: ["A. Xenon ", "B. Argon", "C. Neon", "D. Helium"],
        correctAnswer: 0,
      },
      {
        question: "17. Helium មានទម្ងន់?",
        options: ["A. ធ្ងន់ជាងខ្យល់", "B. ស្មើខ្យល់", "C. ស្រាលជាងខ្យល់ ", "D. ក្លិនខ្លាំង"],
        correctAnswer: 2,
      },
      {
        question: "18. Neon មានពណ៌ភ្លឺពេលបញ្ចូលអគ្គិសនី?",
        options: ["A. ខៀវ", "B. ក្រហម", "C. ទឹកក្រូច ", "D. បៃតង"],
        correctAnswer: 2,
      },
      {
        question: "19. Argon ប្រើក្នុងរូបថតពន្លឺដោយសារតែ?",
        options: ["A. ក្លិនល្អ", "B. មិនច្រេះ ", "C. ងាយឆេះ", "D. រលាយក្នុងទឹក"],
        correctAnswer: 1,
      },
      {
        question: " 20. Radon គួរប្រុងប្រយ័ត្ន ព្រោះ?",
        options: ["A. បង្កឲ្យជំងឺមហារីកសួត ", "B. ងាយកើតភ្លើង", "C. មានរសជាតិខុស", ". មិនអាចចេញពីដី"],
        correctAnswer: 0,
      },
      {
        question: "21. ឧស្ម័នណាដែលពុំមានច្រើនក្នុងធម្មជាតិ?",
        options: ["A. Argon", "B. Xenon ", "C. Neon", "D. Helium"],
        correctAnswer: 1,
      },
      {
        question: "22. ក្រុមឧស្ម័នកម្រ ជាក្រុមនៃធាតុ៖",
        options: ["A. លោហៈ", "B. អលោហៈ ", "C. លោហៈស្រាល", "D. មូលដ្ឋាន"],
        correctAnswer: 1,
      },
      {
        question: "23. ឧស្ម័នណាដែលប្រើក្នុងម៉ាស៊ីនភ្លើងដើម្បីបង្កើនកាំភ្លើងចង្ក្រាន?",
        options: ["A. Krypton ", "B. Helium", "C. Radon", "D. Neon"],
        correctAnswer: 0,
      },
      {
        question: "24. ឧស្ម័នកម្រ មានស្ថានភាពធម្មតា?",
        options: ["A. រាវ", "B. រឹង", "C. ឧស្ម័ន ", "D. ឈើ"],
        correctAnswer: 2,
      },
      {
        question: "25. Oganesson (Og) គឺជា?",
        options: ["A. ឧស្ម័នអសកម្មខ្លាំង", "B. ឧស្ម័នផលិតតាមឧស្សាហកម្ម ", "C. ឧស្ម័នឆៅ", "D. ឧស្ម័នសម្រាប់ផឹក"],
        correctAnswer: 1,
      },
    ],
  },
  {
    category: "ក្រុមលោហៈឆ្លង",
    questions: [
      {
        question: "1. លោហៈឆ្លងមានចំនួនប៉ុន្មានធាតុ?",
        options: [" A. 20", "  B. 25", "  C. 30", "  D. 35"],
        correctAnswer: 2,
      },
      {
        question: "2. លោហៈឆ្លងស្ថិតនៅទីតាំងណា ក្នុងតារាងខួប?",
        options: [" A. ផ្នែកឆ្វេង", "B. ផ្នែកស្តាំ", "C. ផ្នែកកណ្តាល", "D. ផ្នែកខាងលើ"],
        correctAnswer: 2,
      },
      {
        question: "3. លោហៈឆ្លងមានដង់ស៊ីតេដូចម្ដេចជាមួយដង់ស៊ីតេទឹក ",
        options: ["      A. តូចជាង ដង់ស៊ីតេទឹក", "B. ស្មើគ្នា", "C. ធំជាង ដង់ស៊ីតេទឹក ", "D. មិនស្ថិតស្ថេរ"],
        correctAnswer: 2,
      },
      {
        question: " 4. លក្ខណៈរូបរបស់លោហៈឆ្លង?",
        options: ["A. ទន់ និងងាយបែក", "      B. ស្វិត មាំ និងភ្លឺ ", "       C. មិនភ្លឺ", "      D. ប្រេះងាយ"],
        correctAnswer: 1,
      },
      {
        question: "5. លោហៈឆ្លងដែលមានចំណុចរលាយទាប?",
        options: ["A. ប្រាក់", "B. ទង់ដែង", "C. ដែក ", "      D. បារត"],
        correctAnswer: 3,
      },
      {
        question: "  6. លោហៈដែលចម្លងកម្ដៅល្អជាងគេ?",
        options: ["       A. ដែក", "       B. ទង់ដែង", "C. ប្រាក់", "D. ស័ង្កសី"],
        correctAnswer: 2,
      },
      {
        question: "7. លោហៈឆ្លងមានលក្ខណៈគីមី?",
        options: ["A. សកម្មខ្លាំង", "      B. សកម្មខ្សោយជាងអាល់កាឡាំង", "      C. មិនមានប្រតិកម្ម", "D. សកម្មខ្លាំងជាងអាល់កាឡាំង"],
        correctAnswer: 1,
      },
      {
        question: "8. លោហៈឆ្លងធម្មតារងកំណូតទេ",
        options: ["A. រងងាយ", "B. រងឆាប់ណាស់", "C. មិនរងកំណូត (លើកលែងដែក)", "      D. រលាយ"],
        correctAnswer: 2,
      },
      {
        question: "9. ហេតុអ្វីលោហៈឆ្លងពិបាកផ្តាច់អេឡិចត្រុង",
        options: ["      A. ស្រទាប់ក្រៅ 1 ", "B. អេឡិចត្រុងច្រើន", "C. មិនមានអេឡិចត្រុង", "      D. ស្រទាប់ខាងក្នុងទន់"],
        correctAnswer: 1,
      },
      {
        question: "10. ZnO + HCl បង្កើតអ្វី?",
        options: ["      A. ZnO₂", "      B. ZnCl₂ + H₂O ", "C. Zn(OH)₂", "D. Zn + H₂"],
        correctAnswer: 1,
      },
      {
        question: "11. Zn(OH)₂ + HCl បង្កើតអ្វី?",
        options: ["      A. ZnO + H₂", "      B. ZnCl₂ + 2H₂O ", "      C. Zn + H₂O", "D. ZnCl + H₂"],
        correctAnswer: 1,
      },
      {
        question: "12. វ៉ាឡង់ប្រែប្រួលរបស់ដែក?",
        options: ["      A. Fe⁺ និង Fe²⁺", "      B. Fe²⁺ និង Fe³⁺", "C. Fe³⁺ និង Fe⁴⁺", "       D. Fe⁴⁺"],
        correctAnswer: 1,
      },
      {
        question: "13. អ៊ីយ៉ុងកុំផ្លិចមានបន្ទុក?",
        options: ["A. វិជ្ជមាន", "      B. អវិជ្ជមាន", "C. សូន្យ", "      D. ទាំងពីរ"],
        correctAnswer: 1,
      },
      {
        question: "14. Cro₄²⁻ ជាអ៊ីយ៉ុងអ្វី?",
        options: ["A. ស៊ុលហ្វាត", "B. ក្រូម៉ាត", "C. អុកស៊ីត", "D. ឌីក្រូម៉ាត"],
        correctAnswer: 1,
      },
      {
        question: "15. ពណ៌របស់ Fe²⁺?",
        options: ["A. ខៀវ", "B. លឿង", "C. ត្រួយចេក ", "D. ក្រហម"],
        correctAnswer: 2,
      },
      {
        question: "16. ពណ៌របស់ Fe³⁺?",
        options: ["    A. លឿង ", "B. ខ្មៅ", "C. ខៀវ", "D. ប្រផេះ"],
        correctAnswer: 0,
      },
      {
        question: "17. លោហៈឆ្លងជាកាតាលីករដោយសារ?",
        options: ["A. សកម្មខ្លាំង", "B. មិនរងកំណូត", "C. បង្កើនល្បឿនប្រតិកម្ម ", "D. ធ្វើឲ្យឈប់ល្បឿនប្រតិកម្ម"],
        correctAnswer: 2,
      },
      {
        question: "18. ដែកជាកាតាលីករប្រើក្នុង?",
        options: ["A. លំនាំរស្មីសំយោគ", "B. លំនាំHaber", "C. ក្រាគិញ", "D. ប្រតិកម្មបន្សាប"],
        correctAnswer: 1,
      },
      {
        question: "19. សមីការ Haber?",
        options: ["A. N₂ + H₂ → NH₄", "      B. 2N + 3H₂ → NH₃ ", "    C. N₂ + 3H₂ → 2NH₃", "      D. NH₃ → N₂ + H₂"],
        correctAnswer: 2,
      },
      {
        question: " 20. ហេតុអ្វីដែកត្រូវបានប្រើប្រាស់ច្រើនជាងលោហៈផ្សេងៗក្នុងលោហៈឆ្លង?",
        options: ["A. តម្លៃខ្ពស់ ", "B. សកម្មខ្លាំង", "      C. សម្បូរ និងតម្លៃសមរម្យ", "D. ងាយបែក"],
        correctAnswer: 2,
      },
      {
        question: "21. ដែកថែបប្រើសម្រាប់?",
        options: ["A. កង់ម៉ូតូ", "      B. ម៉ាស៊ីនរ៉ាដ្យាទ័រ ", "C. ចង្ក្រានហ្គាស", "D. ម៉ាស៊ីនរថយន្ដ"],
        correctAnswer: 1,
      },
      {
        question: "22. ទង់ដែងប្រើសម្រាប់?",
        options: ["      A. កង់", "B. ខ្សែកាបអគ្គិសនី ", "C. សំណង់", "D. បំពង់ទឹក"],
        correctAnswer: 1,
      },
      {
        question: "23. លោហៈឆ្លងធ្វើអ្វីបានល្អ?",
        options: ["A. ចម្លងកំដៅ ", "B. ចម្លងចរន្តអគ្គិសនី", "C. ទាំងពីរ A និង B", "D. គ្មាន"],
        correctAnswer: 2,
      },
      {
        question: "24. ហេតុអ្វីលោហៈឆ្លងអាចផែជាលូសបាន?",
        options: ["      A. រឹង", "B. ស្វិត", "C. ទន់ ", "      D. មានអេឡិចត្រុងតិច"],
        correctAnswer: 1,
      },
      {
        question: "25. គោលបំណងកាតាលីករ?",
        options: ["A. បន្ថយល្បឿន", "B. កាត់បន្ថយកំដៅ ", "C. បង្កើនល្បឿន", "D. បង្កើតអាស៊ីត"],
        correctAnswer: 2,
      },
    ],
  }, 
];